export type GuestLetter = {
  names: string[]
  text: string
  images: string[]
}

export const guestLetters: GuestLetter[] = [
  {
    names: ['唐嘉璇'],
    text: '亲爱的唐家:\n\n不知不觉，今年已经是我们相识的第19个年头了，不论是放了学也不急着回家的日子，还是在一中的每一餐，我青春时期的每一刻，几乎都不无你的相伴。我们一起经历过的这些，早就不只是某一段时光，而是组成我人生很重要的一部分。\n\n我的嫡长闺，诚挚邀请你，作为我的伴娘，陪我一起走过人生中这个重要而幸福的时刻。',
    images: [],
  },
  {
    names: ['李斯羽'],
    text: '亲爱的李斯:\n\n不知不觉，今年已经是我们相识的将近第15个年头了，我还记得在初中报道第一天，在班里遇到你的喜悦。我也清晰记得，那条你陪我走过一边又一边的初中放学的路。和你在一起的日子，我们总是开心到笑个不停。我青春时期的每一刻，几乎都不无你的相伴。\n\n诚挚邀请你，作为我的伴娘，陪我一起走过人生中这个重要而幸福的时刻。',
    images: [],
  },
  {
    names: ['田滢'],
    text: '亲爱的Dodoo:\n\n不知不觉，今年已经是我们相识的将近第15个年头了，但未曾想，未相见的时间已经有这么长。我还清晰记得，那条我们走了一遍又一遍去托管的路，那些我们一起补习英语、奋斗雅思的日子。我青春时期的每一刻，几乎都不无你的相伴。\n\n诚挚邀请你，作为我的伴娘，陪我一起走过人生中这个重要而幸福的时刻。',
    images: [],
  },
  {
    names: ['黄滢'],
    text: '亲爱的天使:\n\n不知不觉，今年已经是我们相识的第10个年头了。我从来没有想过，我的下铺会成为我人生中最重要的朋友之一。不论是一中的每一餐，还是出国之后的频繁联系，我青春时期的每一刻，几乎都不无你的相伴。\n\n诚挚邀请你，作为我的伴娘，陪我一起走过人生中这个重要而幸福的时刻。',
    images: [],
  },
  {
    names: ['覃愿'],
    text: 'Hello 覃愿:\n\n不知不觉，今年已经是我们相识的将近第15个年头了，那些一起中二、聊动漫、玩游戏的日子，如今想来，依旧觉得珍贵。也常常会觉得幸运，那么多平凡的时刻里，都有你的陪伴。\n\n诚挚邀请你和姐姐，一起来见证我人生中重要的幸福时刻，也想把我的这份幸福，分给你们一点。',
    images: [],
  },
  {
    names: ['赵子濠'],
    text: 'Hello 赵子濠:\n\n不知不觉，今年已经是我们相识的将近第15个年头了，那些一起中二、聊动漫、逛漫展的日子，如今想来，依旧觉得珍贵。也常常会觉得幸运，那么多平凡的时刻里，都有你的陪伴。\n\n诚挚邀请你和俏珺，一起来见证我人生中重要的幸福时刻，也想把我的这份幸福，分给你们一点。',
    images: [],
  },
  {
    names: ['曾煊凯'],
    text: 'Hello 曾煊凯:\n\n不知不觉，今年已经是我们相识的第10个年头了，那时候的我，大概怎么也不会想到，另一个英语课代表，最后会成为我人生中最重要的朋友之一。那些一起聊烦恼、动漫，逛漫展，吃谷子的日子，如今想来，依旧觉得珍贵。也常常会觉得幸运，那么多平凡的时刻里，都有你的陪伴。\n\n诚挚邀请你，来见证我人生中重要的幸福时刻，也想把我的这份幸福，分给你一点。',
    images: [],
  },
  {
    names: ['黄穗'],
    text: '亲爱的黄穗:\n\n不知不觉，今年已经是我们相识的第5个年头了，虽然未见面的时间已经超过了我们相处的时间。我还清晰记得，那些我们一起上课回家、一起出去玩拍照、一起来我家玩桌游吃饭、一起参加毕业典礼的日子。也尤其记得，你包了包子，大晚上非要给我送来吃，如今想来，依然觉得珍贵。也很幸运，在人生那段时光里，有你陪我一起走过。\n\n诚挚邀请你，来见证我人生中重要的幸福时刻，也想把我的这份幸福，分给你一点。',
    images: [],
  },
  {
    names: ['许诺'],
    text: '亲爱的许诺:\n\n今年已经是我们相识的第5个年头了，虽然未见面的时间已经超过了我们相处的时间。那些我们一起上课写作业、一起出去玩拍照、一起来我家玩桌游吃饭的日子，如今想来，依旧觉得珍贵。有时候会觉得很神奇，明明真正一起度过的时间并不算特别长，却留下了这么多值得记住的片段。也很幸运，在人生那段时光里，有你陪我一起走过。\n\n诚挚邀请你，来见证我人生中重要的幸福时刻，也想把我的这份幸福，分给你一点。',
    images: [],
  },
  {
    names: ['刘姿含'],
    text: '亲爱的Hannah:\n\n不知不觉，今年已经是我们相识的将近第8个年头了，但未曾想，未见面的时间已经超过了我们相处的时间。那些我们一起上课写论文、聊课程选择、职业规划的日子，如今想来，依旧觉得珍贵。一直很感谢你总是主动地与我保持联系，即使我们相隔两国。这一次，也想把我的幸福与你分享。\n\n诚挚邀请你与李科兵，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['赖子飞'],
    text: 'Hello 赖子飞:\n\n不知不觉，今年已经是我们相识的第10个年头了，还记得那些你买过的辣条、坐同桌的日子，如今想来，依旧觉得珍贵。\n\n诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['罗粤宁'],
    text: 'Hello 罗粤宁:\n\n不知不觉，今年已经是我们相识的第10个年头了，还记得那些你教我做题、帮我排解烦恼的日子，如今想来，依旧觉得珍贵。\n\n诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['冯敏仪'],
    text: '亲爱的敏仪姐姐:\n\n谢谢一路以来的陪伴，那些一起走过的日子，始终珍贵。这一次，也想把我的幸福与你分享。\n\n诚挚邀请你与小海叔叔，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['李嘉祺'],
    text: '你好，李嘉祺先生，\n\n还记得高一开学前，第一次在群里看到你的名字，我心想这肯定是一位女同学。结果开学你一自我介绍，竟然是男的。后来高中当了那么久同桌，你本人倒是很真实、很好笑，也很靠谱。\n\n高中那段日子现在想起来，真是含金量很高：上课认真炉石，下课影壁墙乱搞。不得不感慨一句，还是高中生活好！话说班长，我们高中聚会什么时候组织？这是人民的心声，领导不能当没听见。\n\n虽然我们现在分隔两地，中间隔着一个小水沟，平常见不到，但 hxd 在心中，瑞思拜。\n\n这一次，诚挚邀请你作为我的伴郎，来见证我人生中重要的幸福时刻。兄弟不常见面，但重要场合必须有你！',
    images: [],
  },
  {
    names: ['黄天宇'],
    text: '你好黄天宇，\n\n由于已知我们婚礼时你在埃及，所以就不邀请你了。但你很幸运作为内测人员来检查下我们的邀请函微信小程序。\n\n如果你看到了这封信，跟我说下，然后看下有没有什么你观察到的bug，谢谢你，给你竖大拇哥！',
    images: [],
  },
  {
    names: ['梁启悦'],
    text: '你好，梁启悦先生，\n\n现在想起来，高中真是我最爽的一段时光，其中最大的原因之一就是有你们这群好哥们。还记得高一高二早上起来一起开卡包，上课一起炉石（虽然我记得你天天就在内里打王者然后手机被房爽没收，或者跟女生搞来搞去），放假了英雄联盟开黑，日子真的很开心，甚至盖过了学习的枯燥与压力。\n\n虽然我们现在能见面的机会不多，但是每年回国一起开黑或者出去玩都是我很期待的事情。hxd在心中，话不多说，懂我意思就行。\n\n这一次，诚挚邀请你作为我的伴郎，来见证我人生中重要的幸福时刻。兄弟不常见面，但重要场合必须有你！',
    images: [],
  },
  {
    names: ['王旭旸'],
    text: '你好，王旭旸先生，\n\n还记得高一第一次见你，你和喆哥坐在一起，感觉像两个小混混一样，我一开始是有点恐惧和你们说话的。后面接触下来才知道你是一个有意思又靠谱的人。还记得高中时我们一起开炉石卡包，一起英雄联盟开黑，真的很开心。\n\n虽然我们现在见面机会不多，一年也就一两次，但每次见面出去玩都是我很期待的事情。好哥们瑞斯拜。\n\n这次诚挚邀请你与你的女朋友，来见证我人生中重要的幸福时刻，分享这份喜悦。',
    images: [],
  },
  {
    names: ['田宇轩'],
    text: '你好，田宇轩先生，\n\n田总发达了不要忘记穷哥们。高中的你是帅气的小学霸一枚，现在的你是风驰于各大国际都市的商业精英。帅气逼人，风流倜傥。\n\n虽然我们现在见面机会不多，一年也就一两次，但每次见面出去玩，玩剧本杀，滑雪，或者搞这搞那，都是我很期待的事情。\n\n希望田总这次能亲临我们的婚礼，来见证我人生中重要的幸福时刻，分享这份喜悦。希望你当上老总了也要识抬举，不要让哥们下不来台。',
    images: [],
  },
  {
    names: ['刘源'],
    text: '你好，刘源先生，\n\n源哥，还记得高中一起打炉石的快乐时光，一起开卡包，组卡组，上课放笔袋里光明正大的玩，日子爽的飞起。虽然我们现在见面机会不多，但我每次回国和你们出去玩，玩剧本杀或者搞这搞那，都是我很期待的事情。\n\n这次诚挚邀请你，来见证我人生中重要的幸福时刻，分享这份喜悦。',
    images: [],
  },
  {
    names: ['张哲'],
    text: '你好，张哲先生，\n\n还记得高中第一次去网吧就是跟你一起去的九号，一起开黑，一起互喷。高中的日子真的很爽，打游戏，打篮球（虽然我就打了几次），天天搞来搞去。但时间转瞬即逝，后来因为疫情的原因我们的联系就慢慢少了。现在我们都不在天津，见面的机会就更少了。\n\n这次诚挚邀请你与你的女朋友，来见证我人生中重要的幸福时刻，也趁此机会和大家一起聚聚，分享这份喜悦。',
    images: [],
  },
  {
    names: ['齐妙缘'],
    text: '你好，齐妙缘女士，\n\n今年已经是我们相识的第14个年头了，没想到你我都已经26岁了，我们认识的时间已经过了人生的一半。还记得初中时每周末和你们出去玩，去唱k，滑冰，或者啥也不干就压马路，是我初中枯燥生活中很开心的时光。虽然我觉得初中的班同学拉完了，老师也拉完了，但还是很幸运遇到了一些玩的到一起去的朋友（包括你），也通过你认识了其他有趣的朋友。\n\n虽然我们现在分隔两地能见面的机会不多，但每次回天津跟你们聚一聚是我每年最期待的时光，希望我们友谊长存，瑞斯拜。\n\n诚挚邀请你和树哥，一起来见证我人生中重要的幸福时刻，也想把我的这份幸福，分给你们一点。',
    images: [],
  },
  {
    names: ['杨智涵'],
    text: '你好，杨智涵先生，\n\n今年已经是我们相识的第13个年头了，时间真的很快，你也不知什么时候开始不叫爸爸妈妈了。我觉得你在一定程度上也算是引领潮流了，在十几年前就开始叫妈妈了。\n\n不搞你了，说实话初中高中时周末一起玩的时间真的很开心，一起唱k，一起滑冰，或者啥也不干逛商场沿马路。\n\n现在我们分隔两地，中间隔着一个小水沟，平常见不到，但每次回国和你和奇妙一群人一起玩是我最期待的时光，好哥们瑞斯拜。\n\n这一次，诚挚邀请你作为我的伴郎，来见证我人生中重要的幸福时刻。兄弟不常见面，但重要场合必须有你！',
    images: [],
  },
  {
    names: ['陈若菡'],
    text: '空你鸡哇，陈桑，\n\n今年是我们相识的第14个年头了，没想到你我都已经26岁了，我们认识的时间已经过了人生的一半。还记得初中时每周末和你们出去玩，去唱k，滑冰，或者啥也不干就压马路，是我初中枯燥生活中很开心的时光。\n\n现在你在日本，我在澳洲，我回国你不回，你回国我不回，上次见面还是在日本，真的太难见一面了。听奇妙说你谈了一个很帅的男朋友，上次和她们一起出去玩了，请务必也介绍给我，让我也养养眼。\n\n这次诚挚邀请你与你的男朋友，来见证我人生中重要的幸福时刻，也趁此机会和大家一起聚聚，分享这份喜悦。',
    images: [],
  },
  {
    names: ['陈新宇'],
    text: '你好，陈新宇先生，\n\n兄弟，真太久没见了啊，上次见面应该还是17年我出国前最后一次玩？真的记不得了，时间过得真快，也真的太久了。\n\n虽然我觉得初中的班拉完了，老师也拉完了，但真的很幸运遇到了你这个志同道合的好哥们。我仍然记得初一初二我们周末总是一起出去玩，去唱k，去滑冰，或者啥也不干压马路，初三时中午一起去天外的食堂吃饭，你总吃两个肉两个菜的盖浇饭多加饭，一起下课后打篮球，考完试后网吧开黑。\n\n当然也记得你初三时犯浑喝酒耍酒疯，抑郁的时光。后来高中后你搬走了，我们见面就少了。再后来我们都出国读书了，就再也没见面了。\n\n不知道你这次能不能来，我当然真心希望你能来，来见证我人生中重要的幸福时刻。如果不能，下次回国请务必告诉我，看下时间一起回去见一面！',
    images: [],
  },
  {
    names: ['刘晓峰'],
    text: '你好，刘晓峰先生，\n\n在澳洲留学那些多少有点枯燥的日子里，尤其是疫情期间被封在家里的时候，和你一起打游戏、一起开黑，堪称重要精神娱乐项目。后来解封之后，一起吃饭聚餐、一起出海钓鱼，也都成了我现在想起来依然很开心的时光。\n\n当然，你也是我为数不多现在还保持联系，并且见证了我和 Shirley 爱情全过程的人。所以我认真思考过，你是不是应该在我们的婚礼上发表一些感言，比如歌颂一下我们的爱情什么的。这个议题我们之后再议，先暂时列入待办。\n\n现在我们分隔两地，中间隔着一个小水沟，平常见不到，只能偶尔有机会见一面、吃个饭。但还是希望我们友谊长存。毕竟你是我出门装逼的自信来源之一，我可以到处说：我好哥们二十多岁已经年入百万。瑞思拜。\n\n这一次，诚挚邀请你作为我的伴郎，来见证我人生中重要的幸福时刻。兄弟不常见面，但重要场合必须有你！',
    images: [],
  },
]
