export type GuestLetter = {
  names: string[]
  text: string
  images: string[]
}

export const guestLetters: GuestLetter[] = [
  {
    names: ['唐嘉璇'],
    text: '亲爱的唐家，今年已经是我们相识的第19个年头了，不论是放了学不回家的日子，还是在一中的每一餐，我青春时期的每一刻，几乎都不无你的相伴。我的嫡长闺，诚挚邀请你，作为我的伴娘，见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['李斯羽'],
    text: '亲爱的李斯，今年已经是我们相识的将近第15个年头了，我还记得在初中报道第一天，在班里遇到你的喜悦。我还清晰记得，那条你陪我走过一边又一边的初中放学的路。和你在一起的日子，我们总是开心到笑个不停。我青春时期的每一刻，几乎都不无你的相伴。诚挚邀请你，作为我的伴娘，见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['田滢'],
    text: '亲爱的Dodoo，今年已经是我们相识的将近第15个年头了，但未曾想，未相见的时间已经有这么长。我还清晰记得，那条我们走了一遍又一遍去托管的路，那些我们一起补习英语、奋斗雅思的日子。我青春时期的每一刻，几乎都不无你的相伴。诚挚邀请你，作为我的伴娘，见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['黄滢'],
    text: '亲爱的天使，今年已经是我们相识的第10个年头了。我从来没有想过，我的下铺会成为我人生中最重要的朋友之一。不论是一中的每一餐，还是出国之后的频繁联系，我青春时期的每一刻，几乎都不无你的相伴。诚挚邀请你，作为我的伴娘，见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['覃愿'],
    text: '今年已经是我们相识的将近第15个年头了，那些一起中二、聊动漫、玩游戏的日子，始终珍贵。诚挚邀请你和姐姐，一起来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['赵子濠'],
    text: '今年已经是我们相识的将近第15个年头了，那些一起中二、聊动漫、逛漫展的日子，始终珍贵。诚挚邀请你和俏珺，一起来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['曾煊凯'],
    text: '今年已经是我们相识的第10个年头了，我未想过，另一个英语课代表会成为我人生中最重要的朋友之一。那些一起聊烦恼、动漫，逛漫展，吃谷子的日子，始终珍贵。诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['黄穗'],
    text: '亲爱的黄穗，今年已经是我们相识的第5个年头了，但未曾想，未见面的时间已经超过了我们相处的时间。我还清晰记得，那些我们一起上课回家、一起出去玩拍照、一起来我家玩桌游吃饭、一起参加毕业典礼的日子。也尤其记得，你包了包子，大晚上非要给我送来吃，如今想来，依然觉得珍贵。诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['许诺'],
    text: '亲爱的许诺，今年已经是我们相识的第5个年头了，但未曾想，未见面的时间已经超过了我们相处的时间。那些我们一起上课写作业、一起出去玩拍照、一起来我家玩桌游吃饭的日子，始终珍贵。诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['刘姿含'],
    text: '亲爱的Hannah，今年已经是我们相识的将近第8个年头了，但未曾想，未见面的时间已经超过了我们相处的时间。那些我们一起上课写论文、聊课程选择、职业规划的日子，始终珍贵。一直很感谢你总是主动地与我保持联系，即使我们相隔两国。诚挚邀请你与李科兵，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['赖子飞'],
    text: '今年已经是我们相识的第10个年头了，还记得那些你买过的辣条、坐同桌的日子，如今想来，依旧觉得珍贵。诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['罗粤宁'],
    text: '今年已经是我们相识的第10个年头了，还记得那些你教我做题、帮我排解烦恼的日子，如今想来，依旧觉得珍贵。诚挚邀请你，来见证我人生中重要的幸福时刻。',
    images: [],
  },
  {
    names: ['冯敏仪'],
    text: '亲爱的敏仪姐姐，谢谢一路以来的陪伴，那些一起走过的日子，始终珍贵。这一次，也想把我的幸福与你分享。诚挚邀请你与小海叔叔，来见证我人生中重要的幸福时刻。',
    images: [],
  },
]
